/* No comment provided by engineer. */
"Address" = "Address";

/* No comment provided by engineer. */
"lang" = "en";

/* No comment provided by engineer. */
"Basket" = "Basket";

/* No comment provided by engineer. */
"ChangeCity" = "Change City";

/* No comment provided by engineer. */
"ChangePassword" = "Change Password";

/* No comment provided by engineer. */
"Complaints" = "Complaints";

/* This message is shown when complaints is empty */
"ComplaintsErrorMessage" = "Please enter a message";

/* No comment provided by engineer. */
"ContactUs" = "Contact Us";

/* No comment provided by engineer. */
"CreateAccount" = "Create Account";

/* Error title */
"Error" = "Error";

/* No comment provided by engineer. */
"errorDecoding" = "Decoding error";

/* First message in on boarding screen */
"FirsetMessage" = "Esfenja between your hands";

/* dialog information title */
"Information" = "Information";

/* No comment provided by engineer. */
"LogIn" = "Log In";

/* ok button */
"OK" = "OK";

/* No comment provided by engineer. */
"Profile" = "Profile";

/* search page view */
"Search" = "Search";

/* Second message in on boarding screen */
"SecondMessage" = "Reach you with one click";

/* No comment provided by engineer. */
"serverError" = "Try again later";

/* Terms and conditions */
"TermsandConditions" = "Termsand and Conditions";

/* Third message in on boarding screen */
"ThirdMessage" = "We make distaces new to you.";

/* No comment provided by engineer. */
"timeOut" = "Time out, please try again later";

/* No comment provided by engineer. */
"unknownError" = "Unknown error";

/* No comment provided by engineer. */
"VerifyNumber" = "Verify Number";

/* No comment provided by engineer. */
"Wallet" = "Wallet";

/* No comment provided by engineer. */
"MinimumQuantity" = "Minimum quantity is 1";

/* No comment provided by engineer. */
"All" = "All";

/* No comment provided by engineer. */
"AccountActivatedSuccessfully" = "Account Activated Successfully";

/* No comment provided by engineer. */
"Profileupdatedsuccessfully" = "Profile is updated successfully";

/* No comment provided by engineer. */
"ChangeLanguage" = "Change Language";

/* No comment provided by engineer. */
"Arabic" = "Arabic";

/* No comment provided by engineer. */
"CANCEL" = "CANCEL";

/* No comment provided by engineer. */
"English" = "English";

/* No comment provided by engineer. */
"PasswordChangedSuccessfully" = "Password Changed Successfully";

"resetPassword" = "Reset Password";

/* No comment provided by engineer. */
"Addressisadded" = "Address is added";

/* No comment provided by engineer. */
"forgetPasswordLabel" = "Enter your phone number and we will send you a password";

"phonePlaceholder" = "Phone number";

/* No comment provided by engineer. */
"Removephoto" = "Remove photo";

"productadd" = "Product is added successfully";

/* No comment provided by engineer. */
"SelectfromAlbum" = "Select from Album";

/* No comment provided by engineer. */
"Takephoto" = "Take a photo";

"AddedSuccessfully" = "Added Successfully";

/** Validations*/

/* No comment provided by engineer. */
"Points" = "Points";

/* No comment provided by engineer. */
"requiredFields" = "All fields are required";

//User name
/* No comment provided by engineer. */
"requiredUsername" = "User name is required";

/* No comment provided by engineer. */
"shortUsername" = "User name is too short";

/* No comment provided by engineer. */
"longUsername" = "User name is too long";

//Password
/* No comment provided by engineer. */
"requiredPassword" = "Password is required";

/* No comment provided by engineer. */
"shortPassword" = "Password must be greater than 6 characters";

//confirm Password

/* No comment provided by engineer. */
"requiredConfirmPassword" = "Confirm password is required";

/* No comment provided by engineer. */
"passwordAndConfirmPasswordDoesNotMatch" = "Password and confirm password does not match";

/* No comment provided by engineer. */
"requiredPasswordAndItsConfirm" = "Password and confirm password are required";


//Phone number

/* No comment provided by engineer. */
"requiredPhoneNumber" = "Phone number is required";

/* No comment provided by engineer. */
"invalidPhoneNumber" = "Wrong phone number";

/* No comment provided by engineer. */
"shortPhoneNumber" = "Phone number must be greater than 7";

/* No comment provided by engineer. */
"phoneIsDigitsOnly" = "Phone Number must contain only digits";

/* No comment provided by engineer. */
"longtPhoneNumber" = "Phone number must be less than or equal 14";


//Weak password

/* No comment provided by engineer. */
"weakPassword" = "Password must be complex";

//Email

/* No comment provided by engineer. */
"requiredEmail" = "Email is required";

/* No comment provided by engineer. */
"invalidEmail" = "This mail is not valid";

"open" = "Opened";

"close" = "Closed";

"ChargeYourWallet" = "Charge your wallet";

"EnterChargeValue" = "Enter charge value";

"Charge" = "Charge";

"Notifications" = "Notifications";

"CreditNotProvidedYet" = "Online payment is not provided yet, coming soon";

"passwordResetSuccessfully" = "New password was sent to your phone number";

"OnlinePayment" = "Online Payment";

"Orders" = "Orders";

"OrderDetails" = "Order Details";

"Loading..." = "Loading...";

//API Response
"SomethingWentWrong" = "Something went wrong";
"NameIsRequired" = "Name is required";
//                      "EmailIsRequiredAndInCorrectFormat"
//                      "PasswordIsRequiredOrMinimumLength"
"ConfirmPasswordIsMissingOrDoesNotMatch" = "";
//                      "PhoneIsRequiredAndInCorrectFormat"
"MobileExists" = "This phone number already exist";
//                      "EmailExists"
//                      "FailedToCreateUser"
//                      "FailedToUpload"
"WrongPhoneOrPassword" = "Wrong phone number or password";
"AccountNotVerified" = "This account is not verified";
"WrongVerificationCode" = "Wrong verification code";
"VerificationCodeDoesNotMatch" = "Verification code doesnot match";
"WrongPassword" = "Wrong phone number or password";
"UserNotFound" = "User not found";
"MessageIsRequired" = "Message is required";
"OrderDescriptionIsRequired" = "Order description is required";
//                      "OrderCountryIsRequired"
//                      "OrderAreaIsRequired"
//                      "UserAddressIsRequired"
//                      "CountryNotFound"
//                      "CityNotFound"
//                      "UserAddressNotFound"
//                      "FloorIsRequired"
//                      "BuildingNumberIsRequired"
//                      "ApartmentIsRequired"
//                      "NoDriversAvailable"
//                      "OrderIdIsRequired"
//                      "OrderTypeIsRequired"
//                      "OrderNotFound"
//                      "DriverRejectedSuccesfullyButNoDriversAvailable"
//                      "DeliveryFeeIsRequired"
//                      "OrderPlacedSuccesfullyButNoDriversAvailable"
//                      "SubTotalIsRequired"
//                      "AmountPaidIsRequired"
//                      "CurrencyIsRequired"
//                      "OrderRejectedSuccesfullyButNoDriversAvailable"
//                      "DeliveryManNotFound"
//                      "ImageRequired"
//                      "WrongDeliveryMan"
//                      "PaymentMethodIsRequired"
"NotEnoughFund" = "No enough charge";
//                      "InvalidReferralCode"
"OrderAcceptedByAnotherDriver" = "This order id accepted by another driver";
//                      "UserDoesNotHaveOrders"
//                      "InvalidOperatingSystem"
//                      "InvalidPushToken"
//                      "LatitudeFieldIsRequired"
//                      "LongitudeFieldIsRequired"
//                      "CityFieldIsRequired"
//                      "LoginDataIsRequired"
//                      "RegisterDataIsRequired"
//                      "UserDoesNotHaveCity"
//                      "StoreNotFound"
//                      "UserNotAuthorized"
//                      "ProductNotFound"
//                      "StoreIsClosed"
//                      "SizeNotFound"
"OrderCannotBeFromMultipleStores" = "Order cannot be from multiple stores";
//                      "BasketItemNotFound"
"CannotDecrease" = "Can't decrease this item";
//                      "UserBasketIsEmpty"
//                      "StoreLocationIsNotDefined"
//                      "InvalidPaymentMethod"
//                      "InvalidStars"
"DriverNotFound" = "This driver is not found";
//                      "DriverDoesNotHaveTheRequiredOrder"
//                      "UserAlreadyRated"
//                      "UserIsNotWorker"
//                      "CannotAcceptOrder"
//                      "DriverCoordinatesUnknown"
//                      "DriverReachedMaximumNumberOfAllowedOrders"
//                      "InvalidFinishCode"
//                      "WrongFacebookAccessToken"
//                      "UserRegisteredFromExternalSource"
//                      "AmountIsLowerThanMinimumAmountToBeCharged"
//                      "AmountIsHigherThanMaximumAmountToBeCharged"
//                      "JobNotFound"
//                      "WorkerNotFound"
//                      "UserIsBlocked"
//                      "PageMustBeGreaterThanZero"
//                      "QuntityNotAvilable"
//                      "YouAddOfferBefore"
//                      "CannotAcceptOfferOverThanMaxFees"
//                      "ItemIsAlreadyInFav"
//                      "ItemIsNotInFav"
//                      "EmptyFavs"
//                      "CategoryNotFound"
//                      "DriverAlreadyExist"
//                      "AccountAlreadyLogged"
//                      "CouponeDoesntExist"
//                      "PointsNotEnough"
//                      "PointsLessthanMinimum"
//                      "YouNotHavepoint"
//                      "QuntityMaximunPointNotAvilable"
